#include <iostream>
#include "search_methods.h"
#include "windows.h"
// ОБОВ'ЯЗКОВО підключаємо ваш заголовний файл

int main() {
    // Налаштування української мови в консолі
	SetConsoleCP(1251); // Встановлюємо кодову сторінку для вводу
	SetConsoleOutputCP(1251); // Встановлюємо кодову сторінку для виводу
    

    // Створюємо демонстраційний масив (для пошуку він має бути відсортованим)
    int arr[] = { 1, 3, 5, 7, 11, 15, 19, 23, 29, 31 };
    int size = sizeof(arr) / sizeof(arr[0]); // Автоматично рахуємо розмір масиву
    int target = 15; // Що саме ми шукаємо

    std::cout << "--- Програма пошуку в масивах ---\n";

    // Виклик ТВОГО методу золотого перерізу
    int index = goldenSectionSearch(arr, size, target);

    if (index != -1) {
        std::cout << "Метод золотого перерізу: елемент знайдено на індексі " << index << "\n";
    }
    else {
        std::cout << "Метод золотого перерізу: елемент не знайдено.\n";
    }

    return 0;
}